doc/PatternJS.org
#+TITLE: PatternJS — regular expressions for trees
#+KEYWORDS: javascript, js, regexp, regular expressions, array, tree, LoL
#+DESCRIPTION: PatternJS -- regular expressions for tree (arrays of arrays)
#+STYLE: <link rel="stylesheet" type="text/css" href="docstyle.css" />
#+AUTHOR: Mihai Bazon
#+EMAIL: mihai.bazon@gmail.com
#+LATEX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper,10pt]
#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \setmonofont{Inconsolata}
#+LaTeX_HEADER: \setmainfont{Linux Libertine O}

* pattern.js -- regular expressions for trees

This is an implementation of a pattern matching engine similar in power to
regular expressions but applicable to trees (array of arrays, in this case)
rather than strings.

Based on ideas in an excellent paper by Russ Cox[fn:cox1], we compile search
queries to a home-made bytecode and provide a specialized VM to run the
bytecode.  The VM can only say if a tree matches a query or not; to search,
we apply the query to all the subtrees.  Speed was not a goal for my
implementation[fn:speed1], but it's pretty fast by my tests.

[fn:cox1] [[http://swtch.com/~rsc/regexp/regexp2.html][http://swtch.com/~rsc/regexp/regexp2.html]]

[fn:speed1] Russ's article provides many optimization hints; for now, my
implementation is the just simplest recursive version.

* Syntax by examples

This library is useful when you need to search something in an array and the
search is more complicated than what indexOf can handle.  In other words,
when the search is even moderately complex, you need this tool.

For example, suppose you're looking for the sequence 3, 4, 5 in the
following array:

#+BEGIN_SRC js
[ 1, 2, 3, 4, 5, 6, 7, 8, 9 ]
#+END_SRC

You would like to know at which index it starts.  You'll usually need to
know where it ends too, but this is a simple expression that doesn't involve
repetitions, so the end index is trivial to get—it's =START + LENGTH=.

With PatternJS we can use the following code:

#+BEGIN_SRC js
var $ = require("pattern");
var haystack = [ 1, 2, 3, 4, 5, 6, 7, 8, 9 ];
var needle = $.compile(3, 4, 5);
$.search(haystack, needle, function onmatch(m){
    console.log(m.$node);              // == haystack in this case
    console.log(m.$start);             // 2
    console.log(m.$end);               // 5
    console.log(m.$match().content()); // [ 3, 4, 5 ]
});
#+END_SRC

The above code shows the basic API to this library.  It exports two main
functions: =compile= and =search=.  The first takes a search query and
returns the compiled bytecode.  The =search= function takes the array to
search, the bytecode to run, and an “onmatch” function.  This function takes
a single argument that contains various information about the match.  Above
I showed the following 4 properties:

- =$node= — the node that matched
- =$start= — the position where match starts
- =$end= — the position where the match ends
- =$match= — this returns a =Match= object.  I'll describe them later.  For
  now you can notice that it has a content() method, which returns the node
  content.  In the case above, =$match().content()= is the same as
  =$node.slice($start, $end)=.

