doc/PatternJS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>PatternJS — regular expressions for trees</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-18 17:49:45 EEST"/>
<meta name="author" content="Mihai Bazon"/>
<meta name="description" content="PatternJS -- regular expressions for tree (arrays of arrays)"/>
<meta name="keywords" content="javascript, js, regexp, regular expressions, array, tree, LoL"/>
<link rel="stylesheet" type="text/css" href="docstyle.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">PatternJS — regular expressions for trees</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 pattern.js &ndash; regular expressions for trees </a></li>
<li><a href="#sec-2">2 Syntax by examples </a>
<ul>
<li><a href="#sec-2-1">2.1 Repetition (<code>MANY</code>, <code>MORE</code>) </a></li>
<li><a href="#sec-2-2">2.2 Wildcard (<code>ANYTHING</code>, <code>WHATEVER</code>) </a></li>
<li><a href="#sec-2-3">2.3 Greedy and non-greedy repetitions (<code>NG</code> suffix) </a></li>
<li><a href="#sec-2-4">2.4 To be or not to be (<code>MAYBE</code>) </a></li>
<li><a href="#sec-2-5">2.5 Alternatives (<code>OR</code>) </a></li>
<li><a href="#sec-2-6">2.6 Grouping expressions (<code>NAMED</code>, <code>GROUP</code>) </a></li>
<li><a href="#sec-2-7">2.7 <code>MAYBE</code> ambiguity? </a></li>
<li><a href="#sec-2-8">2.8 Back references (<code>REF</code>) </a></li>
<li><a href="#sec-2-9">2.9 Replace nodes </a></li>
<li><a href="#sec-2-10">2.10 Substructure matching </a></li>
</ul>
</li>
<li><a href="#sec-3">3 UglifyJS AST examples </a>
<ul>
<li><a href="#sec-3-1">3.1 Discard redundant block parens </a></li>
<li><a href="#sec-3-2">3.2 Sample <code>IF</code> optimizations </a></li>
</ul>
</li>
<li><a href="#sec-4">4 API reference </a>
<ul>
<li><a href="#sec-4-1">4.1 The <code>onmatch</code> function </a></li>
<li><a href="#sec-4-2">4.2 The <code>Match</code> objects </a></li>
</ul>
</li>
<li><a href="#sec-5">5 License </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> pattern.js &ndash; regular expressions for trees </h2>
<div class="outline-text-2" id="text-1">


<p>
This is an implementation of a pattern matching engine similar in power to
regular expressions but applicable to trees (array of arrays, in this case)
rather than strings.
</p>
<p>
Based on ideas in an excellent paper by Russ Cox<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>, we compile search
queries to a home-made bytecode and provide a specialized VM to run the
bytecode.  The VM can only say if a tree matches a query or not; to search,
we apply the query to all the subtrees.  Speed was not a goal for my
implementation<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup>, but it's pretty fast by my tests.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Syntax by examples </h2>
<div class="outline-text-2" id="text-2">


<p>
This library is useful when you need to search something in an array and the
search is more complicated than what indexOf can handle.  In other words,
when the search is even moderately complex, you need this tool.
</p>
<p>
For example, suppose you're looking for the sequence 3, 4, 5 in the
following array:
</p>



<pre class="src src-js">[ 1, 2, 3, 4, 5, 6, 7, 8, 9 ]
</pre>


<p>
You would like to know at which index it starts.  You'll usually need to
know where it ends too, but this is a simple expression that doesn't involve
repetitions, so the end index is trivial to get—it's <code>START + LENGTH</code>.
</p>
<p>
With PatternJS we can use the following code:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">$</span> = require(<span class="org-string">"pattern"</span>);
<span class="org-keyword">var</span> <span class="org-variable-name">haystack</span> = [ 1, 2, 3, 4, 5, 6, 7, 8, 9 ];
<span class="org-keyword">var</span> <span class="org-variable-name">needle</span> = $.compile(3, 4, 5);
$.search(haystack, needle, <span class="org-keyword">function</span> onmatch(<span class="org-variable-name">m</span>){
    console.log(m.$node);              <span class="org-comment-delimiter">// </span><span class="org-comment">== haystack in this case</span>
    console.log(m.$start);             <span class="org-comment-delimiter">// </span><span class="org-comment">2</span>
    console.log(m.$end);               <span class="org-comment-delimiter">// </span><span class="org-comment">5</span>
    console.log(m.$match().content()); <span class="org-comment-delimiter">// </span><span class="org-comment">[ 3, 4, 5 ]</span>
});
</pre>


<p>
The above code shows the basic API to this library.  It exports two main
functions: <code>compile</code> and <code>search</code>.  The first takes a search query and
returns the compiled bytecode.  The <code>search</code> function takes the array to
search, the bytecode to run, and an “onmatch” function.  This function takes
a single argument that contains various information about the match.  Above
I showed the following 4 properties:
</p>
<ul>
<li><code>$node</code> — the node that matched
</li>
<li><code>$start</code> — the position where match starts
</li>
<li><code>$end</code> — the position where the match ends
</li>
<li><code>$match</code> — this returns a <code>Match</code> object.  I'll describe them later.  For
  now you can notice that it has a content() method, which returns the node
  content.  In the case above, <code>$match().content()</code> is the same as
  <code>$node.slice($start, $end)</code>.
</li>
</ul>



</div>
