doc/PatternJS.tex
% Created 2011-09-18 Sun 17:49
\documentclass[a4paper,10pt]{article}
\usepackage{fontspec}
\usepackage{xltxtra}
\usepackage{xunicode}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\setmonofont{Inconsolata}
\setmainfont{Linux Libertine O}
\providecommand{\alert}[1]{\textbf{#1}}

\title{PatternJS — regular expressions for trees}
\author{Mihai Bazon}
\date{\today}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\section{pattern.js -- regular expressions for trees}
\label{sec-1}


This is an implementation of a pattern matching engine similar in power to
regular expressions but applicable to trees (array of arrays, in this case)
rather than strings.

Based on ideas in an excellent paper by Russ Cox\footnote{\href{http://swtch.com/~rsc/regexp/regexp2.html}{http://swtch.com/\~rsc/regexp/regexp2.html} }, we compile search
queries to a home-made bytecode and provide a specialized VM to run the
bytecode.  The VM can only say if a tree matches a query or not; to search,
we apply the query to all the subtrees.  Speed was not a goal for my
implementation\footnote{Russ's article provides many optimization hints; for now, my
implementation is the just simplest recursive version. }, but it's pretty fast by my tests.
\section{Syntax by examples}
\label{sec-2}


This library is useful when you need to search something in an array and the
search is more complicated than what indexOf can handle.  In other words,
when the search is even moderately complex, you need this tool.

For example, suppose you're looking for the sequence 3, 4, 5 in the
following array:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
[ 1, 2, 3, 4, 5, 6, 7, 8, 9 ]
\end{minted}

You would like to know at which index it starts.  You'll usually need to
know where it ends too, but this is a simple expression that doesn't involve
repetitions, so the end index is trivial to get—it's \texttt{START + LENGTH}.

With PatternJS we can use the following code:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var $ = require("pattern");
var haystack = [ 1, 2, 3, 4, 5, 6, 7, 8, 9 ];
var needle = $.compile(3, 4, 5);
$.search(haystack, needle, function onmatch(m){
    console.log(m.$node);              // == haystack in this case
    console.log(m.$start);             // 2
    console.log(m.$end);               // 5
    console.log(m.$match().content()); // [ 3, 4, 5 ]
});
\end{minted}

The above code shows the basic API to this library.  It exports two main
functions: \texttt{compile} and \texttt{search}.  The first takes a search query and
returns the compiled bytecode.  The \texttt{search} function takes the array to
search, the bytecode to run, and an “onmatch” function.  This function takes
a single argument that contains various information about the match.  Above
I showed the following 4 properties:

\begin{itemize}
\item \texttt{\$node} — the node that matched
\item \texttt{\$start} — the position where match starts
\item \texttt{\$end} — the position where the match ends
\item \texttt{\$match} — this returns a \texttt{Match} object.  I'll describe them later.  For
  now you can notice that it has a content() method, which returns the node
  content.  In the case above, \texttt{\$match().content()} is the same as
  \texttt{\$node.slice(\$start, \$end)}.
\end{itemize}
