doc/PatternJS.org
** Repetition (=MANY=, =MORE=)

The above example is already a bit more than =indexOf= can handle, but as
promised, this library is as powerful as regular expressions.  Here's how we
can handle repetition.  Suppose we want to find blocks of one or more “a”-s
in an array:

#+BEGIN_SRC js
var a = [ 1, 2, "a", 3, 4, "a", "a", "a", "b", "a", "a", "c" ];
var pat = $.compile($.MORE("a"));
$.search(a, pat, function(m){
    // log where it starts, where it ends, and contents
    console.log(m.$start, m.$end, m.$match().content());
});
#+END_SRC

We get the following output:

#+BEGIN_SRC js
2 3 [ 'a' ]
5 8 [ 'a', 'a', 'a' ]
9 11 [ 'a', 'a' ]
#+END_SRC

We can also search for repetitive expressions consisting of more than one
node.  For example, finding consecutive occurrences of 2, 3, 4 in an array:

#+BEGIN_SRC js
var a = [ 1, 2, 3, 4, 2, 3, 4, 2, 3, 4, 2, 3, 4, 5 ];
var pat = $.compile($.MORE(2, 3, 4));
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});
// ==> 1 13 [ 2, 3, 4, 2, 3, 4, 2, 3, 4, 2, 3, 4 ]
#+END_SRC

That's right, there's a single contiguous match—the sequence 2, 3, 4 is
repeated 4 times, starting at index 1 and ending at index 13.

=MORE= is in fact the equivalent of =+= in ordinary regexps.  It matches its
argument at least once.  There is also a =MANY= combinator which is like =*=
in regexps—it matches the argument zero or more times:

#+BEGIN_SRC js
var a = [ 1, 2, 3, 2, 4, 4, 4, 1, 2, 4, 0, 2, 0, 1 ];
var pat = $.compile(2, $.MANY(4));
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});
#+END_SRC

The above matches a 2 followed by zero or more 4-s.  It outputs:

#+BEGIN_SRC js
1 2 [ 2 ]
3 7 [ 2, 4, 4, 4 ]
8 10 [ 2, 4 ]
11 12 [ 2 ]
#+END_SRC

** Wildcard (=ANYTHING=, =WHATEVER=)

Ordinary regexps provide an easy way to match “anything”—via a single dot
character.  Or to match a sequence of consecutive “anything”-s (which we
call “whatever”), you would use =.*=.  PatternJS provides similar features,
here are quick examples:

#+BEGIN_SRC js
// match any sequence of type 2, X, 4
var a = [ 1, 2, 3, 4, 2, 4, 2, 1, 4, 5 ];
var pat = $.compile(2, $.ANYTHING(), 4);
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});
#+END_SRC

outputs:

#+BEGIN_SRC js
1 4 [ 2, 3, 4 ]
6 9 [ 2, 1, 4 ]
#+END_SRC

** Greedy and non-greedy repetitions (=NG= suffix)

A similar example with =WHATEVER=:

#+BEGIN_SRC js
var a = [ 1, 2, 3, 4, 2, 4, 2, 1, "a", "b", 4, 5 ];
var pat = $.compile(2, $.WHATEVER(), 4);
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});
#+END_SRC

The output is interesting:

#+BEGIN_SRC js
1 11 [ 2, 3, 4, 2, 4, 2, 1, 'a', 'b', 4 ]
#+END_SRC

Similar to ordinary regexps, the =MANY= and =MORE= constructs are “greedy”.
They match as many characters as possible.  For this reason, because the
expression that we're looking for is “2 followed by whatever sequence
followed by 4” it matches from the first 2 in the array to the last 4.

There are cases, like the above, when we want the repetitive constructs to
be “non-greedy”.  We provide =MANYNG=, =MORENG= and =WHATEVERNG= combinators
for this case.  By the way, =WHATEVER()= is equivalent to
=MANY(ANYTHING())=, and =WHATEVERNG()= is equivalent to
=MANYNG(ANYTHING())=[fn:ngterm1].

[fn:ngterm1] I've nothing to do with the fact that “anything” ends in “ng”
though. ;-)

The non-greedy pattern in the above example would be:

#+BEGIN_SRC js
var pat = $.compile(2, $.WHATEVERNG(), 4);
#+END_SRC

and the output:

#+BEGIN_SRC js
1 4 [ 2, 3, 4 ]
4 6 [ 2, 4 ]
6 11 [ 2, 1, 'a', 'b', 4 ]
#+END_SRC

