doc/PatternJS.html

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Repetition (<code>MANY</code>, <code>MORE</code>) </h3>
<div class="outline-text-3" id="text-2-1">


<p>
The above example is already a bit more than <code>indexOf</code> can handle, but as
promised, this library is as powerful as regular expressions.  Here's how we
can handle repetition.  Suppose we want to find blocks of one or more “a”-s
in an array:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, <span class="org-string">"a"</span>, 3, 4, <span class="org-string">"a"</span>, <span class="org-string">"a"</span>, <span class="org-string">"a"</span>, <span class="org-string">"b"</span>, <span class="org-string">"a"</span>, <span class="org-string">"a"</span>, <span class="org-string">"c"</span> ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile($.MORE(<span class="org-string">"a"</span>));
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    <span class="org-comment-delimiter">// </span><span class="org-comment">log where it starts, where it ends, and contents</span>
    console.log(m.$start, m.$end, m.$match().content());
});
</pre>


<p>
We get the following output:
</p>



<pre class="src src-js">2 3 [ <span class="org-string">'a'</span> ]
5 8 [ <span class="org-string">'a'</span>, <span class="org-string">'a'</span>, <span class="org-string">'a'</span> ]
9 11 [ <span class="org-string">'a'</span>, <span class="org-string">'a'</span> ]
</pre>


<p>
We can also search for repetitive expressions consisting of more than one
node.  For example, finding consecutive occurrences of 2, 3, 4 in an array:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 4, 2, 3, 4, 2, 3, 4, 2, 3, 4, 5 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile($.MORE(2, 3, 4));
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});
<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt; 1 13 [ 2, 3, 4, 2, 3, 4, 2, 3, 4, 2, 3, 4 ]</span>
</pre>


<p>
That's right, there's a single contiguous match—the sequence 2, 3, 4 is
repeated 4 times, starting at index 1 and ending at index 13.
</p>
<p>
<code>MORE</code> is in fact the equivalent of <code>+</code> in ordinary regexps.  It matches its
argument at least once.  There is also a <code>MANY</code> combinator which is like <code>*</code>
in regexps—it matches the argument zero or more times:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 2, 4, 4, 4, 1, 2, 4, 0, 2, 0, 1 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(2, $.MANY(4));
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});
</pre>


<p>
The above matches a 2 followed by zero or more 4-s.  It outputs:
</p>



<pre class="src src-js">1 2 [ 2 ]
3 7 [ 2, 4, 4, 4 ]
8 10 [ 2, 4 ]
11 12 [ 2 ]
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Wildcard (<code>ANYTHING</code>, <code>WHATEVER</code>) </h3>
<div class="outline-text-3" id="text-2-2">


<p>
Ordinary regexps provide an easy way to match “anything”—via a single dot
character.  Or to match a sequence of consecutive “anything”-s (which we
call “whatever”), you would use <code>.*</code>.  PatternJS provides similar features,
here are quick examples:
</p>



<pre class="src src-js"><span class="org-comment-delimiter">// </span><span class="org-comment">match any sequence of type 2, X, 4</span>
<span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 4, 2, 4, 2, 1, 4, 5 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(2, $.ANYTHING(), 4);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});
</pre>


<p>
outputs:
</p>



<pre class="src src-js">1 4 [ 2, 3, 4 ]
6 9 [ 2, 1, 4 ]
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Greedy and non-greedy repetitions (<code>NG</code> suffix) </h3>
<div class="outline-text-3" id="text-2-3">


<p>
A similar example with <code>WHATEVER</code>:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 4, 2, 4, 2, 1, <span class="org-string">"a"</span>, <span class="org-string">"b"</span>, 4, 5 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(2, $.WHATEVER(), 4);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});
</pre>


<p>
The output is interesting:
</p>



<pre class="src src-js">1 11 [ 2, 3, 4, 2, 4, 2, 1, <span class="org-string">'a'</span>, <span class="org-string">'b'</span>, 4 ]
</pre>


<p>
Similar to ordinary regexps, the <code>MANY</code> and <code>MORE</code> constructs are “greedy”.
They match as many characters as possible.  For this reason, because the
expression that we're looking for is “2 followed by whatever sequence
followed by 4” it matches from the first 2 in the array to the last 4.
</p>
<p>
There are cases, like the above, when we want the repetitive constructs to
be “non-greedy”.  We provide <code>MANYNG</code>, <code>MORENG</code> and <code>WHATEVERNG</code> combinators
for this case.  By the way, <code>WHATEVER()</code> is equivalent to
<code>MANY(ANYTHING())</code>, and <code>WHATEVERNG()</code> is equivalent to
=MANYNG(ANYTHING())=<sup><a class="footref" name="fnr.3" href="#fn.3">3</a></sup>.
</p>
<p>
The non-greedy pattern in the above example would be:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(2, $.WHATEVERNG(), 4);
</pre>


<p>
and the output:
</p>



<pre class="src src-js">1 4 [ 2, 3, 4 ]
4 6 [ 2, 4 ]
6 11 [ 2, 1, <span class="org-string">'a'</span>, <span class="org-string">'b'</span>, 4 ]
</pre>


</div>

</div>
