doc/PatternJS.org
** To be or not to be (=MAYBE=)

In ordinary regexps this is provided by the question-mark operator; in
PatternJS it's called =MAYBE=.  Here's an example that matches sequences of
“a”, “b”, optionally separated by a dash:

#+BEGIN_SRC js
var a = [ 1, 2, "a", "b", 3, "a", "x", "b", "a", "-", "b", 3, "a", "b" ];
var pat = $.compile("a", $.MAYBE("-"), "b");
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});

// ==>
// 2 4 [ 'a', 'b' ]
// 8 11 [ 'a', '-', 'b' ]
// 12 14 [ 'a', 'b' ]
#+END_SRC

** Alternatives (=OR=)

You can use =OR= to provide alternatives at a certain point.  Example: match
consecutive sequences of 1, 2, or 3:

#+BEGIN_SRC js
var a = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 3, 2, 1, 4, 5, 6, 2 ];
var pat = $.compile($.MORE($.OR(1, 2, 3)));
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});

// ==>
// 0 3 [ 1, 2, 3 ]
// 9 12 [ 3, 2, 1 ]
// 15 16 [ 2 ]
#+END_SRC

Note that =OR= takes multiple “atoms” and returns a combinator that matches
any of them.  Passing that to =MORE=, I got a combinator that matches a
sequence of 1, 2 or 3.  In a regexp you would do “(1|2|3)+”.  Because =OR=
returns a single expression, there's an implicit grouping above.

How would you devise an expression matching “a”, “b” OR “c”, “d” (that is,
either an “a” followed by a “b”, or a “c” followed by a “d”).  You would
need one of the combinators in the next section.

