doc/PatternJS.html

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> To be or not to be (<code>MAYBE</code>) </h3>
<div class="outline-text-3" id="text-2-4">


<p>
In ordinary regexps this is provided by the question-mark operator; in
PatternJS it's called <code>MAYBE</code>.  Here's an example that matches sequences of
“a”, “b”, optionally separated by a dash:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, <span class="org-string">"a"</span>, <span class="org-string">"b"</span>, 3, <span class="org-string">"a"</span>, <span class="org-string">"x"</span>, <span class="org-string">"b"</span>, <span class="org-string">"a"</span>, <span class="org-string">"-"</span>, <span class="org-string">"b"</span>, 3, <span class="org-string">"a"</span>, <span class="org-string">"b"</span> ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(<span class="org-string">"a"</span>, $.MAYBE(<span class="org-string">"-"</span>), <span class="org-string">"b"</span>);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});

<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2 4 [ 'a', 'b' ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">8 11 [ 'a', '-', 'b' ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">12 14 [ 'a', 'b' ]</span>
</pre>


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Alternatives (<code>OR</code>) </h3>
<div class="outline-text-3" id="text-2-5">


<p>
You can use <code>OR</code> to provide alternatives at a certain point.  Example: match
consecutive sequences of 1, 2, or 3:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 3, 2, 1, 4, 5, 6, 2 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile($.MORE($.OR(1, 2, 3)));
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});

<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">0 3 [ 1, 2, 3 ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">9 12 [ 3, 2, 1 ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">15 16 [ 2 ]</span>
</pre>


<p>
Note that <code>OR</code> takes multiple “atoms” and returns a combinator that matches
any of them.  Passing that to <code>MORE</code>, I got a combinator that matches a
sequence of 1, 2 or 3.  In a regexp you would do “(1|2|3)+”.  Because <code>OR</code>
returns a single expression, there's an implicit grouping above.
</p>
<p>
How would you devise an expression matching “a”, “b” OR “c”, “d” (that is,
either an “a” followed by a “b”, or a “c” followed by a “d”).  You would
need one of the combinators in the next section.
</p>
</div>

</div>
