doc/PatternJS.org
** Grouping expressions (=NAMED=, =GROUP=)

In ordinary regexps you can group sub-expressions with parens.  That serves
two purposes: firstly it can limit action of other operations to only a part
of the expression, as in =a(foo|bar)b= — without the parens, the pipe would
pick between =afoo= and =barb=; and secondly, you can reference those groups
after a match using a convenient shortcut.  In Perl for example, you can
access each group with =$1=, =$2= etc. (a =$= followed by the group index).

=GROUP= takes any number of expressions and matches when those expressions
are found in sequence.  It's the solution to the last question in the
previous section.  To match either “a” followed by “b”, or “c” followed by
“d”:

#+BEGIN_SRC js
var a = [ 1, 2, "a", 3, "c", "d", 4, "a", "b", 5, "c", "e" ];
var pat = $.compile($.OR($.GROUP("a", "b"),
                         $.GROUP("c", "d")));
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});

// ==>
// 4 6 [ 'c', 'd' ]
// 7 9 [ 'a', 'b' ]
#+END_SRC

=NAMED= is like =GROUP=, but the first argument must be a name by which you
want to access the match later.  For example:

#+BEGIN_SRC js
var a = [
    "foo", "=", 1,
    "bar", "=", 2,
    "baz", "=", 3
];
var pat = $.compile(
    $.NAMED("key", $.ANYTHING()),
    "=",
    $.NAMED("val") // missing expression implies $.ANYTHING()
);
$.search(a, pat, function(m){
    console.log(m.key.content(), m.val.content());
});
#+END_SRC

outputs:

#+BEGIN_SRC js
[ 'foo' ] [ 1 ]
[ 'bar' ] [ 2 ]
[ 'baz' ] [ 3 ]
#+END_SRC

The actual pattern to search for is =ANYTHING= = =ANYTHING=.  (the second
one is =$.NAMED("val")=, but lacking any expression, =ANYTHING()= is
implied).

The first =ANYTHING= is being assigned the name “key”, and the second one
“val”.  As you can see, on a successful match they become properties of the
data object “m”.  Those properties are =Match= objects and they provide some
useful methods, one of which is =content()=, which simply returns all the
matched content.  As you can see above, =content()= returns an array—because
expressions can generally match multiple elements.

Here's another example to make this more obvious:

#+BEGIN_SRC js
var a = [
    "foo", "=", 1,
    "bar", "=", 2,
    "baz", "=", 3
];
var pat = $.compile(
    $.NAMED("def", $.ANYTHING(), "=", $.ANYTHING())
);
$.search(a, pat, function(m){
    console.log(m.def.content());
});

// ==>
// [ 'foo', '=', 1 ]
// [ 'bar', '=', 2 ]
// [ 'baz', '=', 3 ]
#+END_SRC

As you can see, =NAMED= can take more than two arguments—anything
following the name is part of the searched expression.  =content()= returns
the three of them this time.

When you are only interested in the first element of the =content()= array,
you can use =first()= as a shortcut for =content()[0]=.  There is more to be
said about =Match= objects, as you'll see below.

