doc/PatternJS.html

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Grouping expressions (<code>NAMED</code>, <code>GROUP</code>) </h3>
<div class="outline-text-3" id="text-2-6">


<p>
In ordinary regexps you can group sub-expressions with parens.  That serves
two purposes: firstly it can limit action of other operations to only a part
of the expression, as in <code>a(foo|bar)b</code> — without the parens, the pipe would
pick between <code>afoo</code> and <code>barb</code>; and secondly, you can reference those groups
after a match using a convenient shortcut.  In Perl for example, you can
access each group with <code>$1</code>, <code>$2</code> etc. (a <code>$</code> followed by the group index).
</p>
<p>
<code>GROUP</code> takes any number of expressions and matches when those expressions
are found in sequence.  It's the solution to the last question in the
previous section.  To match either “a” followed by “b”, or “c” followed by
“d”:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, <span class="org-string">"a"</span>, 3, <span class="org-string">"c"</span>, <span class="org-string">"d"</span>, 4, <span class="org-string">"a"</span>, <span class="org-string">"b"</span>, 5, <span class="org-string">"c"</span>, <span class="org-string">"e"</span> ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile($.OR($.GROUP(<span class="org-string">"a"</span>, <span class="org-string">"b"</span>),
                         $.GROUP(<span class="org-string">"c"</span>, <span class="org-string">"d"</span>)));
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
});

<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">4 6 [ 'c', 'd' ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">7 9 [ 'a', 'b' ]</span>
</pre>


<p>
<code>NAMED</code> is like <code>GROUP</code>, but the first argument must be a name by which you
want to access the match later.  For example:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [
    <span class="org-string">"foo"</span>, <span class="org-string">"="</span>, 1,
    <span class="org-string">"bar"</span>, <span class="org-string">"="</span>, 2,
    <span class="org-string">"baz"</span>, <span class="org-string">"="</span>, 3
];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(<span class="org-string">"key"</span>, $.ANYTHING()),
    <span class="org-string">"="</span>,
    $.NAMED(<span class="org-string">"val"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">missing expression implies $.ANYTHING()</span>
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.key.content(), m.val.content());
});
</pre>


<p>
outputs:
</p>



<pre class="src src-js">[ <span class="org-string">'foo'</span> ] [ 1 ]
[ <span class="org-string">'bar'</span> ] [ 2 ]
[ <span class="org-string">'baz'</span> ] [ 3 ]
</pre>


<p>
The actual pattern to search for is <code>ANYTHING</code> = <code>ANYTHING</code>.  (the second
one is <code>$.NAMED("val")</code>, but lacking any expression, <code>ANYTHING()</code> is
implied).
</p>
<p>
The first <code>ANYTHING</code> is being assigned the name “key”, and the second one
“val”.  As you can see, on a successful match they become properties of the
data object “m”.  Those properties are <code>Match</code> objects and they provide some
useful methods, one of which is <code>content()</code>, which simply returns all the
matched content.  As you can see above, <code>content()</code> returns an array—because
expressions can generally match multiple elements.
</p>
<p>
Here's another example to make this more obvious:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [
    <span class="org-string">"foo"</span>, <span class="org-string">"="</span>, 1,
    <span class="org-string">"bar"</span>, <span class="org-string">"="</span>, 2,
    <span class="org-string">"baz"</span>, <span class="org-string">"="</span>, 3
];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(<span class="org-string">"def"</span>, $.ANYTHING(), <span class="org-string">"="</span>, $.ANYTHING())
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.def.content());
});

<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">[ 'foo', '=', 1 ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">[ 'bar', '=', 2 ]</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">[ 'baz', '=', 3 ]</span>
</pre>


<p>
As you can see, <code>NAMED</code> can take more than two arguments—anything
following the name is part of the searched expression.  <code>content()</code> returns
the three of them this time.
</p>
<p>
When you are only interested in the first element of the <code>content()</code> array,
you can use <code>first()</code> as a shortcut for <code>content()[0]</code>.  There is more to be
said about <code>Match</code> objects, as you'll see below.
</p>
</div>

</div>
