doc/PatternJS.tex
\subsection{Grouping expressions (\texttt{NAMED}, \texttt{GROUP})}
\label{sec-2-6}


In ordinary regexps you can group sub-expressions with parens.  That serves
two purposes: firstly it can limit action of other operations to only a part
of the expression, as in \texttt{a(foo|bar)b} — without the parens, the pipe would
pick between \texttt{afoo} and \texttt{barb}; and secondly, you can reference those groups
after a match using a convenient shortcut.  In Perl for example, you can
access each group with \texttt{\$1}, \texttt{\$2} etc. (a \texttt{\$} followed by the group index).

\texttt{GROUP} takes any number of expressions and matches when those expressions
are found in sequence.  It's the solution to the last question in the
previous section.  To match either “a” followed by “b”, or “c” followed by
“d”:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [ 1, 2, "a", 3, "c", "d", 4, "a", "b", 5, "c", "e" ];
var pat = $.compile($.OR($.GROUP("a", "b"),
                         $.GROUP("c", "d")));
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
});

// ==>
// 4 6 [ 'c', 'd' ]
// 7 9 [ 'a', 'b' ]
\end{minted}

\texttt{NAMED} is like \texttt{GROUP}, but the first argument must be a name by which you
want to access the match later.  For example:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [
    "foo", "=", 1,
    "bar", "=", 2,
    "baz", "=", 3
];
var pat = $.compile(
    $.NAMED("key", $.ANYTHING()),
    "=",
    $.NAMED("val") // missing expression implies $.ANYTHING()
);
$.search(a, pat, function(m){
    console.log(m.key.content(), m.val.content());
});
\end{minted}

outputs:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
[ 'foo' ] [ 1 ]
[ 'bar' ] [ 2 ]
[ 'baz' ] [ 3 ]
\end{minted}

The actual pattern to search for is \texttt{ANYTHING} = \texttt{ANYTHING}.  (the second
one is \texttt{\$.NAMED("val")}, but lacking any expression, \texttt{ANYTHING()} is
implied).

The first \texttt{ANYTHING} is being assigned the name “key”, and the second one
“val”.  As you can see, on a successful match they become properties of the
data object “m”.  Those properties are \texttt{Match} objects and they provide some
useful methods, one of which is \texttt{content()}, which simply returns all the
matched content.  As you can see above, \texttt{content()} returns an array—because
expressions can generally match multiple elements.

Here's another example to make this more obvious:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [
    "foo", "=", 1,
    "bar", "=", 2,
    "baz", "=", 3
];
var pat = $.compile(
    $.NAMED("def", $.ANYTHING(), "=", $.ANYTHING())
);
$.search(a, pat, function(m){
    console.log(m.def.content());
});

// ==>
// [ 'foo', '=', 1 ]
// [ 'bar', '=', 2 ]
// [ 'baz', '=', 3 ]
\end{minted}

As you can see, \texttt{NAMED} can take more than two arguments—anything
following the name is part of the searched expression.  \texttt{content()} returns
the three of them this time.

When you are only interested in the first element of the \texttt{content()} array,
you can use \texttt{first()} as a shortcut for \texttt{content()[0]}.  There is more to be
said about \texttt{Match} objects, as you'll see below.
