doc/PatternJS.org
** =MAYBE= ambiguity?

=NAMED= introduces a funny question when used in conjunction with the
=MAYBE= combinator.  What does the following output:

#+BEGIN_SRC js
var a = [ "a", "b", "b", "b", "c" ];
var pat = $.compile("a", $.MAYBE("b"), "b", $.NAMED("f", $.MORE("b"), "c"));
$.search(a, pat, function(m){
    console.log(m.f.content());
});
#+END_SRC

Well, it outputs =[ 'b', 'c' ]=, because even the =MAYBE= operator is
greedy!  Being so, it takes as many characters as possible.  The first part
of the expression could have matched only =[ 'a', 'b' ]=, instead of =[ 'a',
'b', 'b' ]=, but the greedy-ish nature of =MAYBE= made it take all it could.

For this reason, even though it seems seldom useful, there is a non-greedy
version of =MAYBE=, which, of course, it's called =MAYBENG=.  With the
following pattern the result is different:

#+BEGIN_SRC js
pat = $.compile("a", $.MAYBENG("b"), "b", $.NAMED("f", $.MORE("b"), "c"));
// ==> [ 'b', 'b', 'c' ]
#+END_SRC

** Back references (=REF=)

Once you gave a name to a sub-expression, you can refer to it in the search
query.  This part is commonly =\N= in regular expressions (where =N= is the
index of the parenthesized group).

In PatternJS it's =REF("name")=.  For a quick example, let's try to find all
sequences of elements that repeat two or more times:

#+BEGIN_SRC js
var a = [ 1, 2, 3, 3, 3, 2, 2, 1, 2, 1, 1, 1, 1, 1, 2, 3, 3 ];
var pat = $.compile(
    $.NAMED("a", $.ANYTHING()),
    $.MORE(
        $.REF("a")
    )
);
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
    console.log("    A =", m.a.content());
});
#+END_SRC

The output is:

#+BEGIN_SRC js
2 5 [ 3, 3, 3 ]
    A = [ 3 ]
5 7 [ 2, 2 ]
    A = [ 2 ]
9 14 [ 1, 1, 1, 1, 1 ]
    A = [ 1 ]
15 17 [ 3, 3 ]
    A = [ 3 ]
#+END_SRC

So the expression is:

1. accept /anything/, and /name/ it “a”
2. accept one or /more/ occurrences of what “a” matched.

Note that because =NAMED= takes any arbitrary expression, =REF= in turn is
able to refer back to an arbitrarily complex match.  It needs not be a
simple literal:

#+BEGIN_SRC js
var a = [
    1, 2, 3, // noise
    "a", "+", 1,
    4, 5, 6, // noise
    "a", "+", 1,
    "foo", "bar"
];
var pat = $.compile(
    $.NAMED("a", $.ANYTHING(), "+", $.ANYTHING()),
    $.WHATEVER(),
    $.REF("a")
);
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
    console.log("    A =", m.a.content());
});
#+END_SRC

==>

#+BEGIN_SRC js
3 12 [ 'a', '+', 1, 4, 5, 6, 'a', '+', 1 ]
    A = [ 'a', '+', 1 ]
#+END_SRC

