doc/PatternJS.html

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> <code>MAYBE</code> ambiguity? </h3>
<div class="outline-text-3" id="text-2-7">


<p>
<code>NAMED</code> introduces a funny question when used in conjunction with the
<code>MAYBE</code> combinator.  What does the following output:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ <span class="org-string">"a"</span>, <span class="org-string">"b"</span>, <span class="org-string">"b"</span>, <span class="org-string">"b"</span>, <span class="org-string">"c"</span> ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(<span class="org-string">"a"</span>, $.MAYBE(<span class="org-string">"b"</span>), <span class="org-string">"b"</span>, $.NAMED(<span class="org-string">"f"</span>, $.MORE(<span class="org-string">"b"</span>), <span class="org-string">"c"</span>));
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.f.content());
});
</pre>


<p>
Well, it outputs <code>[ 'b', 'c' ]</code>, because even the <code>MAYBE</code> operator is
greedy!  Being so, it takes as many characters as possible.  The first part
of the expression could have matched only <code>[ 'a', 'b' ]</code>, instead of <code>[ 'a', 'b', 'b' ]</code>, but the greedy-ish nature of <code>MAYBE</code> made it take all it could.
</p>
<p>
For this reason, even though it seems seldom useful, there is a non-greedy
version of <code>MAYBE</code>, which, of course, it's called <code>MAYBENG</code>.  With the
following pattern the result is different:
</p>



<pre class="src src-js">pat = $.compile(<span class="org-string">"a"</span>, $.MAYBENG(<span class="org-string">"b"</span>), <span class="org-string">"b"</span>, $.NAMED(<span class="org-string">"f"</span>, $.MORE(<span class="org-string">"b"</span>), <span class="org-string">"c"</span>));
<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt; [ 'b', 'b', 'c' ]</span>
</pre>


</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Back references (<code>REF</code>) </h3>
<div class="outline-text-3" id="text-2-8">


<p>
Once you gave a name to a sub-expression, you can refer to it in the search
query.  This part is commonly <code>\N</code> in regular expressions (where <code>N</code> is the
index of the parenthesized group).
</p>
<p>
In PatternJS it's <code>REF("name")</code>.  For a quick example, let's try to find all
sequences of elements that repeat two or more times:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 3, 3, 2, 2, 1, 2, 1, 1, 1, 1, 1, 2, 3, 3 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(<span class="org-string">"a"</span>, $.ANYTHING()),
    $.MORE(
        $.REF(<span class="org-string">"a"</span>)
    )
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
    console.log(<span class="org-string">"    A ="</span>, m.a.content());
});
</pre>


<p>
The output is:
</p>



<pre class="src src-js">2 5 [ 3, 3, 3 ]
    A = [ 3 ]
5 7 [ 2, 2 ]
    A = [ 2 ]
9 14 [ 1, 1, 1, 1, 1 ]
    A = [ 1 ]
15 17 [ 3, 3 ]
    A = [ 3 ]
</pre>


<p>
So the expression is:
</p>
<ol>
<li>accept <i>anything</i>, and <i>name</i> it “a”
</li>
<li>accept one or <i>more</i> occurrences of what “a” matched.
</li>
</ol>


<p>
Note that because <code>NAMED</code> takes any arbitrary expression, <code>REF</code> in turn is
able to refer back to an arbitrarily complex match.  It needs not be a
simple literal:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [
    1, 2, 3, <span class="org-comment-delimiter">// </span><span class="org-comment">noise</span>
    <span class="org-string">"a"</span>, <span class="org-string">"+"</span>, 1,
    4, 5, 6, <span class="org-comment-delimiter">// </span><span class="org-comment">noise</span>
    <span class="org-string">"a"</span>, <span class="org-string">"+"</span>, 1,
    <span class="org-string">"foo"</span>, <span class="org-string">"bar"</span>
];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(<span class="org-string">"a"</span>, $.ANYTHING(), <span class="org-string">"+"</span>, $.ANYTHING()),
    $.WHATEVER(),
    $.REF(<span class="org-string">"a"</span>)
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.$start, m.$end, m.$match().content());
    console.log(<span class="org-string">"    A ="</span>, m.a.content());
});
</pre>


<p>
==&gt;
</p>



<pre class="src src-js">3 12 [ <span class="org-string">'a'</span>, <span class="org-string">'+'</span>, 1, 4, 5, 6, <span class="org-string">'a'</span>, <span class="org-string">'+'</span>, 1 ]
    A = [ <span class="org-string">'a'</span>, <span class="org-string">'+'</span>, 1 ]
</pre>


</div>

</div>
