doc/PatternJS.tex
\subsection{\texttt{MAYBE} ambiguity?}
\label{sec-2-7}


\texttt{NAMED} introduces a funny question when used in conjunction with the
\texttt{MAYBE} combinator.  What does the following output:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [ "a", "b", "b", "b", "c" ];
var pat = $.compile("a", $.MAYBE("b"), "b", $.NAMED("f", $.MORE("b"), "c"));
$.search(a, pat, function(m){
    console.log(m.f.content());
});
\end{minted}

Well, it outputs \texttt{[ 'b', 'c' ]}, because even the \texttt{MAYBE} operator is
greedy!  Being so, it takes as many characters as possible.  The first part
of the expression could have matched only \texttt{[ 'a', 'b' ]}, instead of \texttt{[ 'a', 'b', 'b' ]}, but the greedy-ish nature of \texttt{MAYBE} made it take all it could.

For this reason, even though it seems seldom useful, there is a non-greedy
version of \texttt{MAYBE}, which, of course, it's called \texttt{MAYBENG}.  With the
following pattern the result is different:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
pat = $.compile("a", $.MAYBENG("b"), "b", $.NAMED("f", $.MORE("b"), "c"));
// ==> [ 'b', 'b', 'c' ]
\end{minted}
\subsection{Back references (\texttt{REF})}
\label{sec-2-8}


Once you gave a name to a sub-expression, you can refer to it in the search
query.  This part is commonly \texttt{\textbackslash{}N} in regular expressions (where \texttt{N} is the
index of the parenthesized group).

In PatternJS it's \texttt{REF("name")}.  For a quick example, let's try to find all
sequences of elements that repeat two or more times:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [ 1, 2, 3, 3, 3, 2, 2, 1, 2, 1, 1, 1, 1, 1, 2, 3, 3 ];
var pat = $.compile(
    $.NAMED("a", $.ANYTHING()),
    $.MORE(
        $.REF("a")
    )
);
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
    console.log("    A =", m.a.content());
});
\end{minted}

The output is:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
2 5 [ 3, 3, 3 ]
    A = [ 3 ]
5 7 [ 2, 2 ]
    A = [ 2 ]
9 14 [ 1, 1, 1, 1, 1 ]
    A = [ 1 ]
15 17 [ 3, 3 ]
    A = [ 3 ]
\end{minted}

So the expression is:

\begin{enumerate}
\item accept \emph{anything}, and \emph{name} it “a”
\item accept one or \emph{more} occurrences of what “a” matched.
\end{enumerate}

Note that because \texttt{NAMED} takes any arbitrary expression, \texttt{REF} in turn is
able to refer back to an arbitrarily complex match.  It needs not be a
simple literal:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [
    1, 2, 3, // noise
    "a", "+", 1,
    4, 5, 6, // noise
    "a", "+", 1,
    "foo", "bar"
];
var pat = $.compile(
    $.NAMED("a", $.ANYTHING(), "+", $.ANYTHING()),
    $.WHATEVER(),
    $.REF("a")
);
$.search(a, pat, function(m){
    console.log(m.$start, m.$end, m.$match().content());
    console.log("    A =", m.a.content());
});
\end{minted}

==>


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
3 12 [ 'a', '+', 1, 4, 5, 6, 'a', '+', 1 ]
    A = [ 'a', '+', 1 ]
\end{minted}
