doc/PatternJS.html

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Replace nodes </h3>
<div class="outline-text-3" id="text-2-9">


<p>
One common feature of regular expression engines is the ability to replace
either entirely, or partially, the matched expression with something else.
PatternJS provides some features to help with that.
</p>
<p>
Here's the most basic sample:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [ 1, 2, 3, 4, 5 ];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    2, 3, 4
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    m.$match().replace([ <span class="org-string">"cut"</span> ]);
});
console.log(a);

<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">[ 1, 'cut', 5 ]</span>
</pre>


<p>
More generally, a <code>Match</code> node has the following methods:
</p>
<ul>
<li><code>content()</code> — which you already saw: it returns an array with the
  elements matched by this sub-expression.
</li>
<li><code>first()</code> — equivalent to <code>content()[0]</code>
</li>
<li><code>replace(content)</code> — replace this match, in its parent node, by the
  given <code>content</code>.  <code>content</code> must be an array, or another <code>Match</code> object.
</li>
<li><code>swap(obj)</code> — exchange this match with the given <code>Match</code> object.  The
  content of <code>obj</code> will be <code>this.content()</code>, and <code>this.content()</code> will be
  the content of <code>obj</code>.
</li>
</ul>


<p>
In another example we're switching two named nodes:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [
    <span class="org-string">"foo"</span>, <span class="org-string">"="</span>, 1,
    <span class="org-string">"bar"</span>, <span class="org-string">"="</span>, 2,
    <span class="org-string">"baz"</span>, <span class="org-string">"="</span>, 3
];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(<span class="org-string">"key"</span>),
    <span class="org-string">"="</span>,
    $.NAMED(<span class="org-string">"val"</span>)
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    m.key.swap(m.val);
});
console.log(a);

<span class="org-comment-delimiter">// </span><span class="org-comment">==&gt;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">[ 1, '=', 'foo', 2, '=', 'bar', 3, '=', 'baz' ]</span>
</pre>


</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> Substructure matching </h3>
<div class="outline-text-3" id="text-2-10">


<p>
So far we've seen that PatternJS can do on arrays what classical regular
expressions can do on strings.  You might have noticed that we left out a
certain feature of regexps—“character classes”.  That's the <code>[a-z]</code>
operator.  It's because it doesn't make much sense here: while regexps
operate on chars, PatternJS operates on elements of arbitrary types.
</p>
<p>
In examples above the elements of the expression or of the array to search
were strings or numbers.  There is one type which is treated specially:
arrays.  Put simply, when an element of the search expression is an array,
it gets compiled in a subexpression that must match an array at current
position.  I'm not sure this explanation is clear, but an example should
help:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> = [
    1, 2, 3, <span class="org-comment-delimiter">// </span><span class="org-comment">noise</span>
    [ <span class="org-string">"a"</span>, [ <span class="org-string">"b"</span>, <span class="org-string">"c"</span> ] ],            <span class="org-comment-delimiter">// </span><span class="org-comment">**1</span>
    [ <span class="org-string">"a"</span>, [ <span class="org-string">"b"</span>, <span class="org-string">"e"</span> ] ],
    [ <span class="org-string">"a"</span>, [ <span class="org-string">"b"</span>, <span class="org-string">"d"</span>,                <span class="org-comment-delimiter">// </span><span class="org-comment">**2</span>
             [ <span class="org-string">"a"</span>, [ <span class="org-string">"b"</span>, <span class="org-string">"c"</span> ] ]    <span class="org-comment-delimiter">// </span><span class="org-comment">**3</span>
           ] ]
];
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(
        <span class="org-string">"exp"</span>,
        [ <span class="org-string">"a"</span>, [ <span class="org-string">"b"</span>, $.OR(<span class="org-string">"c"</span>, <span class="org-string">"d"</span>) ] ]
    )
);
$.search(a, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    console.log(m.exp.first());
});
</pre>


<p>
Note that this time the expression isn't flat anymore.  It's an array that
starts with “a”, followed by an array that starts with “b” and continues
with either “c” or “d”.  The algorithm matches it faithfully.  The output
is:
</p>



<pre class="src src-js">[ <span class="org-string">'a'</span>, [ <span class="org-string">'b'</span>, <span class="org-string">'c'</span> ] ]
[ <span class="org-string">'a'</span>, [ <span class="org-string">'b'</span>, <span class="org-string">'d'</span>, [ <span class="org-string">'a'</span>, [Object] ] ] ]
[ <span class="org-string">'a'</span>, [ <span class="org-string">'b'</span>, <span class="org-string">'c'</span> ] ]
</pre>


<p>
The matched parts are marked with ** above.  Note that it matched <code>["a", ["b", "d"...]]</code> even though there is stuff following the “d” in the
haystack—this is by design: the expressions are not anchored at the right
side.
</p>
<p>
To force that the array finishes at the right side, you can use <code>END()</code>:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(
        <span class="org-string">"exp"</span>,
        [ <span class="org-string">"a"</span>, [ <span class="org-string">"b"</span>, $.OR(<span class="org-string">"c"</span>, <span class="org-string">"d"</span>), $.END() ] ]
    )
);

<span class="org-comment-delimiter">// </span><span class="org-comment">and the result with this is ==&gt;</span>
[ <span class="org-string">'a'</span>, [ <span class="org-string">'b'</span>, <span class="org-string">'c'</span> ] ]
[ <span class="org-string">'a'</span>, [ <span class="org-string">'b'</span>, <span class="org-string">'c'</span> ] ]
</pre>


</div>
</div>

</div>
