doc/PatternJS.tex
\subsection{Replace nodes}
\label{sec-2-9}


One common feature of regular expression engines is the ability to replace
either entirely, or partially, the matched expression with something else.
PatternJS provides some features to help with that.

Here's the most basic sample:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [ 1, 2, 3, 4, 5 ];
var pat = $.compile(
    2, 3, 4
);
$.search(a, pat, function(m){
    m.$match().replace([ "cut" ]);
});
console.log(a);

// ==>
// [ 1, 'cut', 5 ]
\end{minted}

More generally, a \texttt{Match} node has the following methods:

\begin{itemize}
\item \texttt{content()} — which you already saw: it returns an array with the
  elements matched by this sub-expression.
\item \texttt{first()} — equivalent to \texttt{content()[0]}
\item \texttt{replace(content)} — replace this match, in its parent node, by the
  given \texttt{content}.  \texttt{content} must be an array, or another \texttt{Match} object.
\item \texttt{swap(obj)} — exchange this match with the given \texttt{Match} object.  The
  content of \texttt{obj} will be \texttt{this.content()}, and \texttt{this.content()} will be
  the content of \texttt{obj}.
\end{itemize}

In another example we're switching two named nodes:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [
    "foo", "=", 1,
    "bar", "=", 2,
    "baz", "=", 3
];
var pat = $.compile(
    $.NAMED("key"),
    "=",
    $.NAMED("val")
);
$.search(a, pat, function(m){
    m.key.swap(m.val);
});
console.log(a);

// ==>
// [ 1, '=', 'foo', 2, '=', 'bar', 3, '=', 'baz' ]
\end{minted}
\subsection{Substructure matching}
\label{sec-2-10}


So far we've seen that PatternJS can do on arrays what classical regular
expressions can do on strings.  You might have noticed that we left out a
certain feature of regexps—“character classes”.  That's the \texttt{[a-z]}
operator.  It's because it doesn't make much sense here: while regexps
operate on chars, PatternJS operates on elements of arbitrary types.

In examples above the elements of the expression or of the array to search
were strings or numbers.  There is one type which is treated specially:
arrays.  Put simply, when an element of the search expression is an array,
it gets compiled in a subexpression that must match an array at current
position.  I'm not sure this explanation is clear, but an example should
help:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var a = [
    1, 2, 3, // noise
    [ "a", [ "b", "c" ] ],            // **1
    [ "a", [ "b", "e" ] ],
    [ "a", [ "b", "d",                // **2
             [ "a", [ "b", "c" ] ]    // **3
           ] ]
];
var pat = $.compile(
    $.NAMED(
        "exp",
        [ "a", [ "b", $.OR("c", "d") ] ]
    )
);
$.search(a, pat, function(m){
    console.log(m.exp.first());
});
\end{minted}

Note that this time the expression isn't flat anymore.  It's an array that
starts with “a”, followed by an array that starts with “b” and continues
with either “c” or “d”.  The algorithm matches it faithfully.  The output
is:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
[ 'a', [ 'b', 'c' ] ]
[ 'a', [ 'b', 'd', [ 'a', [Object] ] ] ]
[ 'a', [ 'b', 'c' ] ]
\end{minted}

The matched parts are marked with ** above.  Note that it matched \texttt{["a", ["b", "d"...]]} even though there is stuff following the “d” in the
haystack—this is by design: the expressions are not anchored at the right
side.

To force that the array finishes at the right side, you can use \texttt{END()}:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var pat = $.compile(
    $.NAMED(
        "exp",
        [ "a", [ "b", $.OR("c", "d"), $.END() ] ]
    )
);

// and the result with this is ==>
[ 'a', [ 'b', 'c' ] ]
[ 'a', [ 'b', 'c' ] ]
\end{minted}
