doc/PatternJS.org
* UglifyJS AST examples

Actually this was the reason why I started this library.
UglifyJS[fn:uglifyjs1] generates a complex AST to match the JavaScript
program structure.  Here is an example:

[fn:uglifyjs1] [[https://github.com/mishoo/UglifyJS][https://github.com/mishoo/UglifyJS]] — a JavaScript
parser/compressor toolkit

#+BEGIN_SRC js
  // Program:
  function fact(n) {
          if (n == 1) {
                  return 1;
          } else {
                  return n * fact(n - 1);
          }
  }

  // AST:
  [ 'toplevel',
    [ [ 'defun',
        'fact',
        [ 'n' ],
        [ [ 'if',
            [ 'binary', '==', [ 'name', 'n' ], [ 'num', 1 ] ],
            [ 'block', [ [ 'return', [ 'num', 1 ] ] ] ],
            [ 'block',
              [ [ 'return',
                  [ 'binary',
                    '*',
                    [ 'name', 'n' ],
                    [ 'call',
                      [ 'name', 'fact' ],
                      [ [ 'binary', '-', [ 'name', 'n' ], [ 'num', 1 ] ] ]]]]]]]]]]]
#+END_SRC

We can observe a few things, for example:

- a function definition looks like: =[ 'defun', NAME, ARGS, BODY ]=, where
  =NAME= is the function name, =ARGS= is an array of argument names, and
  =BODY= is an array of statements that the function consists of; statements
  in this array are full AST-s themselves;

- an =IF= statement looks like: =[ 'if', CONDITION, THEN, ELSE ]=; all the
  arguments are AST-s themselves;

- a block of statements is =[ 'block', [ STATEMENT, STATEMENT, ... ]]=;

- a reference to a variable is =[ 'name', VARNAME ]=; etc.

I thought having a powerful pattern engine would help simplify some things
in UglifyJS, but it's not powerful enough yet.  UglifyJS provides extensive
features for traversing and transforming the AST (its =ast_walker= API),
that can also provide some intimate details like full parent list of the
current node, variables in scope, etc.

In any case, PatternJS can be used for various searches/transforms of an
UglifyJS AST, and I'll provide some examples below.

