doc/PatternJS.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> UglifyJS AST examples </h2>
<div class="outline-text-2" id="text-3">


<p>
Actually this was the reason why I started this library.
UglifyJS<sup><a class="footref" name="fnr.4" href="#fn.4">4</a></sup> generates a complex AST to match the JavaScript
program structure.  Here is an example:
</p>



<pre class="src src-js"><span class="org-comment-delimiter">// </span><span class="org-comment">Program:</span>
<span class="org-keyword">function</span> <span class="org-function-name">fact</span>(<span class="org-variable-name">n</span>) {
        <span class="org-keyword">if</span> (n == 1) {
                <span class="org-keyword">return</span> 1;
        } <span class="org-keyword">else</span> {
                <span class="org-keyword">return</span> n * fact(n - 1);
        }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">AST:</span>
[ <span class="org-string">'toplevel'</span>,
  [ [ <span class="org-string">'defun'</span>,
      <span class="org-string">'fact'</span>,
      [ <span class="org-string">'n'</span> ],
      [ [ <span class="org-string">'if'</span>,
          [ <span class="org-string">'binary'</span>, <span class="org-string">'=='</span>, [ <span class="org-string">'name'</span>, <span class="org-string">'n'</span> ], [ <span class="org-string">'num'</span>, 1 ] ],
          [ <span class="org-string">'block'</span>, [ [ <span class="org-string">'return'</span>, [ <span class="org-string">'num'</span>, 1 ] ] ] ],
          [ <span class="org-string">'block'</span>,
            [ [ <span class="org-string">'return'</span>,
                [ <span class="org-string">'binary'</span>,
                  <span class="org-string">'*'</span>,
                  [ <span class="org-string">'name'</span>, <span class="org-string">'n'</span> ],
                  [ <span class="org-string">'call'</span>,
                    [ <span class="org-string">'name'</span>, <span class="org-string">'fact'</span> ],
                    [ [ <span class="org-string">'binary'</span>, <span class="org-string">'-'</span>, [ <span class="org-string">'name'</span>, <span class="org-string">'n'</span> ], [ <span class="org-string">'num'</span>, 1 ] ] ]]]]]]]]]]]
</pre>


<p>
We can observe a few things, for example:
</p>
<ul>
<li>a function definition looks like: <code>[ 'defun', NAME, ARGS, BODY ]</code>, where
  <code>NAME</code> is the function name, <code>ARGS</code> is an array of argument names, and
  <code>BODY</code> is an array of statements that the function consists of; statements
  in this array are full AST-s themselves;

</li>
<li>an <code>IF</code> statement looks like: <code>[ 'if', CONDITION, THEN, ELSE ]</code>; all the
  arguments are AST-s themselves;

</li>
<li>a block of statements is <code>[ 'block', [ STATEMENT, STATEMENT, ... ]]</code>;

</li>
<li>a reference to a variable is <code>[ 'name', VARNAME ]</code>; etc.
</li>
</ul>


<p>
I thought having a powerful pattern engine would help simplify some things
in UglifyJS, but it's not powerful enough yet.  UglifyJS provides extensive
features for traversing and transforming the AST (its <code>ast_walker</code> API),
that can also provide some intimate details like full parent list of the
current node, variables in scope, etc.
</p>
<p>
In any case, PatternJS can be used for various searches/transforms of an
UglifyJS AST, and I'll provide some examples below.
</p>

</div>
