doc/PatternJS.tex
\section{UglifyJS AST examples}
\label{sec-3}


Actually this was the reason why I started this library.
UglifyJS\footnote{\href{https://github.com/mishoo/UglifyJS}{https://github.com/mishoo/UglifyJS} — a JavaScript
parser/compressor toolkit } generates a complex AST to match the JavaScript
program structure.  Here is an example:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
// Program:
function fact(n) {
        if (n == 1) {
                return 1;
        } else {
                return n * fact(n - 1);
        }
}

// AST:
[ 'toplevel',
  [ [ 'defun',
      'fact',
      [ 'n' ],
      [ [ 'if',
          [ 'binary', '==', [ 'name', 'n' ], [ 'num', 1 ] ],
          [ 'block', [ [ 'return', [ 'num', 1 ] ] ] ],
          [ 'block',
            [ [ 'return',
                [ 'binary',
                  '*',
                  [ 'name', 'n' ],
                  [ 'call',
                    [ 'name', 'fact' ],
                    [ [ 'binary', '-', [ 'name', 'n' ], [ 'num', 1 ] ] ]]]]]]]]]]]
\end{minted}

We can observe a few things, for example:

\begin{itemize}
\item a function definition looks like: \texttt{[ 'defun', NAME, ARGS, BODY ]}, where
  \texttt{NAME} is the function name, \texttt{ARGS} is an array of argument names, and
  \texttt{BODY} is an array of statements that the function consists of; statements
  in this array are full AST-s themselves;
\item an \texttt{IF} statement looks like: \texttt{[ 'if', CONDITION, THEN, ELSE ]}; all the
  arguments are AST-s themselves;
\item a block of statements is \texttt{[ 'block', [ STATEMENT, STATEMENT, ... ]]};
\item a reference to a variable is \texttt{[ 'name', VARNAME ]}; etc.
\end{itemize}

I thought having a powerful pattern engine would help simplify some things
in UglifyJS, but it's not powerful enough yet.  UglifyJS provides extensive
features for traversing and transforming the AST (its \texttt{ast\_walker} API),
that can also provide some intimate details like full parent list of the
current node, variables in scope, etc.

In any case, PatternJS can be used for various searches/transforms of an
UglifyJS AST, and I'll provide some examples below.
