doc/PatternJS.html

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Discard redundant block parens </h3>
<div class="outline-text-3" id="text-3-1">


<p>
We could easily replace blocks that contain a single statement with the
statement, therefore discarding the brackets:
</p>



<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">$</span> = require(<span class="org-string">"pattern"</span>);
<span class="org-keyword">var</span> <span class="org-variable-name">U</span> = require(<span class="org-string">"uglify-js"</span>);
<span class="org-keyword">var</span> <span class="org-variable-name">sys</span> = require(<span class="org-string">"util"</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">sample program (passed through the UglifyJS parser to get the AST)</span>
<span class="org-keyword">var</span> <span class="org-variable-name">ast</span> = U.parser.parse(<span class="org-keyword">function</span> a(<span class="org-variable-name">foo</span>){
    <span class="org-keyword">if</span> (foo) {
        bar();
    } <span class="org-keyword">else</span> {
        baz();
    }
    <span class="org-keyword">if</span> (moo) {
        foo();
        bar();
    }
}.toString());

console.log(sys.inspect(ast, <span class="org-constant">null</span>, <span class="org-constant">null</span>));

<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.NAMED(<span class="org-string">"block"</span>,
            [ <span class="org-string">"block"</span>, [
                $.NAMED(<span class="org-string">"stat"</span>, $.ANYTHING()),
                $.END()
            ]])
);
$.search(ast, pat, <span class="org-keyword">function</span>(<span class="org-variable-name">m</span>){
    m.block.replace(m.stat);
});

console.log(U.uglify.gen_code(ast, { beautify: <span class="org-constant">true</span> }));
</pre>


<p>
The AST which is printed first is this:
</p>



<pre class="src src-js">[ <span class="org-string">'toplevel'</span>,
  [ [ <span class="org-string">'defun'</span>,
      <span class="org-string">'a'</span>,
      [ <span class="org-string">'foo'</span> ],
      [ [ <span class="org-string">'if'</span>,
          [ <span class="org-string">'name'</span>, <span class="org-string">'foo'</span> ],
          [ <span class="org-string">'block'</span>,   <span class="org-comment-delimiter">// </span><span class="org-comment">***</span>
            [ [ <span class="org-string">'stat'</span>, [ <span class="org-string">'call'</span>, [ <span class="org-string">'name'</span>, <span class="org-string">'bar'</span> ], [] ] ] ] ],
          [ <span class="org-string">'block'</span>,   <span class="org-comment-delimiter">// </span><span class="org-comment">***</span>
            [ [ <span class="org-string">'stat'</span>, [ <span class="org-string">'call'</span>, [ <span class="org-string">'name'</span>, <span class="org-string">'baz'</span> ], [] ] ] ] ] ],
        [ <span class="org-string">'if'</span>,
          [ <span class="org-string">'name'</span>, <span class="org-string">'moo'</span> ],
          [ <span class="org-string">'block'</span>,   <span class="org-comment-delimiter">// </span><span class="org-comment">this doesn't match as it has two statements</span>
            [ [ <span class="org-string">'stat'</span>, [ <span class="org-string">'call'</span>, [ <span class="org-string">'name'</span>, <span class="org-string">'foo'</span> ], [] ] ],
              [ <span class="org-string">'stat'</span>, [ <span class="org-string">'call'</span>, [ <span class="org-string">'name'</span>, <span class="org-string">'bar'</span> ], [] ] ] ] ],
          <span class="org-constant">undefined</span> ] ] ] ] ]
</pre>


<p>
I marked with <code>***</code> the positions where the pattern will match.  The
spurious block brackets are dropped and the output is:
</p>



<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">a</span>(<span class="org-variable-name">foo</span>) {
    <span class="org-keyword">if</span> (foo) bar(); <span class="org-keyword">else</span> baz();
    <span class="org-keyword">if</span> (moo) {
        foo();
        bar();
    }
}
</pre>


<p>
This is one optimization that UglifyJS does with a lot more code.  But we
should note that the pattern version is not safe—it should keep parens
around <code>IF</code> statements without <code>ELSE</code>, that are themselves in an <code>IF</code> <i>with</i>
an <code>ELSE</code>.  It's quite tricky to do with the pattern engine alone.
</p>
<p>
We could extend it to store parent information and report it in the data
object.
</p>



<pre class="src src-js">[ <span class="org-comment-delimiter">// </span><span class="org-comment">1</span>
    <span class="org-string">"block"</span>,
    [ <span class="org-comment-delimiter">// </span><span class="org-comment">2</span>
        [ <span class="org-string">"stat"</span>, ... ] <span class="org-comment-delimiter">// </span><span class="org-comment">3</span>
    ]
]
</pre>


<p>
In the above example, a generic pattern engine might note that the parent of
the array 3 is the array 2.  But that's not the kind of information we're
looking for—when dealing with UglifyJS trees we care to know that the
parent of the statement is the block (thus, node 1).
</p>
</div>

</div>
