doc/PatternJS.tex
\subsection{Discard redundant block parens}
\label{sec-3-1}


We could easily replace blocks that contain a single statement with the
statement, therefore discarding the brackets:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
var $ = require("pattern");
var U = require("uglify-js");
var sys = require("util");

// sample program (passed through the UglifyJS parser to get the AST)
var ast = U.parser.parse(function a(foo){
    if (foo) {
        bar();
    } else {
        baz();
    }
    if (moo) {
        foo();
        bar();
    }
}.toString());

console.log(sys.inspect(ast, null, null));

var pat = $.compile(
    $.NAMED("block",
            [ "block", [
                $.NAMED("stat", $.ANYTHING()),
                $.END()
            ]])
);
$.search(ast, pat, function(m){
    m.block.replace(m.stat);
});

console.log(U.uglify.gen_code(ast, { beautify: true }));
\end{minted}

The AST which is printed first is this:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
[ 'toplevel',
  [ [ 'defun',
      'a',
      [ 'foo' ],
      [ [ 'if',
          [ 'name', 'foo' ],
          [ 'block',   // ***
            [ [ 'stat', [ 'call', [ 'name', 'bar' ], [] ] ] ] ],
          [ 'block',   // ***
            [ [ 'stat', [ 'call', [ 'name', 'baz' ], [] ] ] ] ] ],
        [ 'if',
          [ 'name', 'moo' ],
          [ 'block',   // this doesn't match as it has two statements
            [ [ 'stat', [ 'call', [ 'name', 'foo' ], [] ] ],
              [ 'stat', [ 'call', [ 'name', 'bar' ], [] ] ] ] ],
          undefined ] ] ] ] ]
\end{minted}

I marked with \texttt{***} the positions where the pattern will match.  The
spurious block brackets are dropped and the output is:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
function a(foo) {
    if (foo) bar(); else baz();
    if (moo) {
        foo();
        bar();
    }
}
\end{minted}

This is one optimization that UglifyJS does with a lot more code.  But we
should note that the pattern version is not safe—it should keep parens
around \texttt{IF} statements without \texttt{ELSE}, that are themselves in an \texttt{IF} \emph{with}
an \texttt{ELSE}.  It's quite tricky to do with the pattern engine alone.

We could extend it to store parent information and report it in the data
object.


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
[ // 1
    "block",
    [ // 2
        [ "stat", ... ] // 3
    ]
]
\end{minted}

In the above example, a generic pattern engine might note that the parent of
the array 3 is the array 2.  But that's not the kind of information we're
looking for—when dealing with UglifyJS trees we care to know that the
parent of the statement is the block (thus, node 1).
