doc/PatternJS.org
** Sample =IF= optimizations

In the following sample we apply some small optimizations to =IF=
statements:

- when there is a single statement in both of the branches, convert to
  conditional;
- when the condition is =<== or =>==, reverse =THEN= with =ELSE= and change
  the operator to =>= or =<=;

#+BEGIN_SRC js
var $ = require("pattern");
var U = require("uglify-js");
var sys = require("util");

// sample program (passed through the UglifyJS parser to get the AST)
var ast = U.parser.parse(function a(foo){
    if (foo) {
        bar();
    } else {
        baz();
    }
    if (moo) {
        foo();
        bar();
    }
    if (a <= b) {
        f();
    } else {
        g();
    }
}.toString());

console.log(sys.inspect(ast, null, null));

// helper function to be used with $.CHECK
function NOT_NULL(val){ return val != null };

// another helper: generate an expression that matches either one
// statement or a block containing exactly one statement.
function ONE_STATEMENT(name) {
    return $.OR(
        [ "stat", $.NAMED(name) ],
        [ "block", [
            [ "stat", $.NAMED(name) ],
            $.END()
        ]]
    );
};

// pattern definition
var pat = $.compile(
    $.OR(
        // this finds stuff like if (a<=b) ... else ...
        [ "if", [ "binary",
                  $.NAMED("operator", $.OR("<=", ">=")) ],
          $.NAMED("th", $.CHECK(NOT_NULL)),
          $.NAMED("el", $.CHECK(NOT_NULL)) ],

        // this finds IFs having exactly one statement on the branches
        $.NAMED("to_conditional",
                [ "if", $.NAMED("co"), ONE_STATEMENT("th"), ONE_STATEMENT("el") ])

    )
);

function onmatch(m) {
    if (m.operator) {
        m.operator.replace([ m.operator.first() == "<=" ? ">" : "<" ]);
        m.th.swap(m.el);
        return m.$start; // *** see below for an explanation of this
    }
    if (m.to_conditional) {
        m.to_conditional.replace([
            [ "stat",
              [ "conditional", m.co.first(), m.th.first(), m.el.first() ]]
        ]);
    }
}

$.search(ast, pat, onmatch);

console.log(U.uglify.gen_code(ast, { beautify: true }));
#+END_SRC

The output is:

#+BEGIN_SRC js
function a(foo) {
    foo ? bar() : baz();
    if (moo) {
        foo();
        bar();
    }
    a > b ? g() : f();
}
#+END_SRC

With a relatively simple pattern and =onmatch= function we managed to do
some non-trivial transformation to a piece of source code[fn:2].  Note that
after handling the first expression in =onmatch= we =return $m.start=.  If
you return anything from the function, it should be a number and it tells
PatternJS where to continue the search.  By returning =m.$start= we tell it
to re-run the expression at the same position where it found the match.
Otherwise it would continue from /after/ the expression, leaving the last
=if= like this[fn:3]:

[fn:2] well, also thanks to the parser and code generator provided by
UglifyJS.

[fn:3] for obvious reasons, since the second part of the regexp never had a
chance to run.

#+BEGIN_SRC js
    if (a > b) {
        g();
    } else {
        f();
    }
#+END_SRC






