doc/PatternJS.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Sample <code>IF</code> optimizations </h3>
<div class="outline-text-3" id="text-3-2">


<p>
In the following sample we apply some small optimizations to <code>IF</code>
statements:
</p>
<ul>
<li>when there is a single statement in both of the branches, convert to
  conditional;
</li>
<li>when the condition is <code>&lt;=</code> or <code>&gt;=</code>, reverse <code>THEN</code> with <code>ELSE</code> and change
  the operator to <code>&gt;</code> or <code>&lt;</code>;
</li>
</ul>





<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">$</span> = require(<span class="org-string">"pattern"</span>);
<span class="org-keyword">var</span> <span class="org-variable-name">U</span> = require(<span class="org-string">"uglify-js"</span>);
<span class="org-keyword">var</span> <span class="org-variable-name">sys</span> = require(<span class="org-string">"util"</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">sample program (passed through the UglifyJS parser to get the AST)</span>
<span class="org-keyword">var</span> <span class="org-variable-name">ast</span> = U.parser.parse(<span class="org-keyword">function</span> a(<span class="org-variable-name">foo</span>){
    <span class="org-keyword">if</span> (foo) {
        bar();
    } <span class="org-keyword">else</span> {
        baz();
    }
    <span class="org-keyword">if</span> (moo) {
        foo();
        bar();
    }
    <span class="org-keyword">if</span> (a &lt;= b) {
        f();
    } <span class="org-keyword">else</span> {
        g();
    }
}.toString());

console.log(sys.inspect(ast, <span class="org-constant">null</span>, <span class="org-constant">null</span>));

<span class="org-comment-delimiter">// </span><span class="org-comment">helper function to be used with $.CHECK</span>
<span class="org-keyword">function</span> <span class="org-function-name">NOT_NULL</span>(<span class="org-variable-name">val</span>){ <span class="org-keyword">return</span> val != <span class="org-constant">null</span> };

<span class="org-comment-delimiter">// </span><span class="org-comment">another helper: generate an expression that matches either one</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">statement or a block containing exactly one statement.</span>
<span class="org-keyword">function</span> <span class="org-function-name">ONE_STATEMENT</span>(<span class="org-variable-name">name</span>) {
    <span class="org-keyword">return</span> $.OR(
        [ <span class="org-string">"stat"</span>, $.NAMED(name) ],
        [ <span class="org-string">"block"</span>, [
            [ <span class="org-string">"stat"</span>, $.NAMED(name) ],
            $.END()
        ]]
    );
};

<span class="org-comment-delimiter">// </span><span class="org-comment">pattern definition</span>
<span class="org-keyword">var</span> <span class="org-variable-name">pat</span> = $.compile(
    $.OR(
        <span class="org-comment-delimiter">// </span><span class="org-comment">this finds stuff like if (a&lt;=b) ... else ...</span>
        [ <span class="org-string">"if"</span>, [ <span class="org-string">"binary"</span>,
                  $.NAMED(<span class="org-string">"operator"</span>, $.OR(<span class="org-string">"&lt;="</span>, <span class="org-string">"&gt;="</span>)) ],
          $.NAMED(<span class="org-string">"th"</span>, $.CHECK(NOT_NULL)),
          $.NAMED(<span class="org-string">"el"</span>, $.CHECK(NOT_NULL)) ],

        <span class="org-comment-delimiter">// </span><span class="org-comment">this finds IFs having exactly one statement on the branches</span>
        $.NAMED(<span class="org-string">"to_conditional"</span>,
                [ <span class="org-string">"if"</span>, $.NAMED(<span class="org-string">"co"</span>), ONE_STATEMENT(<span class="org-string">"th"</span>), ONE_STATEMENT(<span class="org-string">"el"</span>) ])

    )
);

<span class="org-keyword">function</span> <span class="org-function-name">onmatch</span>(<span class="org-variable-name">m</span>) {
    <span class="org-keyword">if</span> (m.operator) {
        m.operator.replace([ m.operator.first() == <span class="org-string">"&lt;="</span> ? <span class="org-string">"&gt;"</span> : <span class="org-string">"&lt;"</span> ]);
        m.th.swap(m.el);
        <span class="org-keyword">return</span> m.$start; <span class="org-comment-delimiter">// </span><span class="org-comment">*** see below for an explanation of this</span>
    }
    <span class="org-keyword">if</span> (m.to_conditional) {
        m.to_conditional.replace([
            [ <span class="org-string">"stat"</span>,
              [ <span class="org-string">"conditional"</span>, m.co.first(), m.th.first(), m.el.first() ]]
        ]);
    }
}

$.search(ast, pat, onmatch);

console.log(U.uglify.gen_code(ast, { beautify: <span class="org-constant">true</span> }));
</pre>


<p>
The output is:
</p>



<pre class="src src-js"><span class="org-keyword">function</span> <span class="org-function-name">a</span>(<span class="org-variable-name">foo</span>) {
    foo ? bar() : baz();
    <span class="org-keyword">if</span> (moo) {
        foo();
        bar();
    }
    a &gt; b ? g() : f();
}
</pre>


<p>
With a relatively simple pattern and <code>onmatch</code> function we managed to do
some non-trivial transformation to a piece of source code<sup><a class="footref" name="fnr.5" href="#fn.5">5</a></sup>.  Note that
after handling the first expression in <code>onmatch</code> we <code>return $m.start</code>.  If
you return anything from the function, it should be a number and it tells
PatternJS where to continue the search.  By returning <code>m.$start</code> we tell it
to re-run the expression at the same position where it found the match.
Otherwise it would continue from <i>after</i> the expression, leaving the last
<code>if</code> like this<sup><a class="footref" name="fnr.6" href="#fn.6">6</a></sup>:
</p>



<pre class="src src-js"><span class="org-keyword">if</span> (a &gt; b) {
    g();
} <span class="org-keyword">else</span> {
    f();
}
</pre>







</div>
</div>

</div>
