doc/PatternJS.org
* API reference

This section won't be too useful if you didn't go through the examples.

This package exports a few functions and combinators.  They are all
available both in lower-case and in upper-case (note this doesn't mean
they're case insensitive though).  I prefer to use upper-case for
combinators inside expressions, and lower-case for the compile/search
functions.

- =compile(expr)= — to compile an expression into bytecode
- =search(array, expr, onmatch)= — to search a compiled expression on an array

Expression combinators:

- =OR(case1, case2, ...)= — returns an expression that matches any of a few
  alternate cases;

- =MAYBE(expr, [expr, ...])= — returns an expression that matches =expr= if
  found, but does not fail if not found;

- =MANY(expr, [expr, ...])= — returns an expression that matches any number of
  occurrences of =expr= (or zero occurrences);

- =MORE(expr, [expr, ...])= — match at least one occurrence of =expr=;

- =ANYTHING()= — match any expression;

- =WHATEVER()= — equivalent to =MANY(ANYTHING())=;

- =GROUP(expr, [expr, ...])= — returns a single expression that matches a
  sequence of expressions;

- =NAMED(name, expr, [expr, ...])= — like =GROUP= but gives the new
  expression a name.  If you omit =expr= it defaults to =ANYTHING()=;

- =REF(name)= — returns an expression that matches the same content as
  matched previously by a =NAMED= group with name =name=;

- =CHECK(predicate)= — matches the current expression if
  =predicate(expression)= returns non-false;

- =END()= — matches only at the end of the array;

- =MANYNG=, =MORENG=, =MAYBENG=, =WHATEVERNG= — the non-greedy versions for
  combinators involving backtracking.

Above when I wrote =expr, [expr, ...]= I meant to say that those functions
take multiple arguments.  The following lines don't match the same
expressions:

#+BEGIN_SRC js
GROUP("a", "b", "c");
GROUP([ "a", "b", "c" ]);
#+END_SRC

I tried to stress this in some examples.  The first one matches the sequence
anywhere, while the second one asserts that the sequence is at the start of
an array.

** The =onmatch= function

The function you pass to =search()= recevies one parameter, let's call it
=m=, that can be used to figure out various things about the match:

- =m.$node= — the array where the current match is found;
- =m.$start= — the index in =$node= where the current match is found;
- =m.$end= — the index where the match ends;
- =m.$match()= — returns the current match as a =Match= object (see below);
- additionally, =NAMED= expressions insert properties into this object.

This function may modify $node.  Some helper API is provided for this by
=Match= objects.  If it returns anything, it must be a valid index in
=$node=, and searching will continue at that position.  Without a return
value, the algorithm continues searching *after* the current match.

** The =Match= objects

They have the following methods:

- =replace(content)= — replaces the current node with the given =content=
  (which may be an array or a =Match= object);
- =swap(node)= — swap two =Match= objects — meaning that the content of one
  replaces the content of the other in the original tree;
- =content()= — returns the content that this node matches, as an array;
- =first()= — returns the first node in the content; same as =content()[0]=.

