doc/PatternJS.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> API reference </h2>
<div class="outline-text-2" id="text-4">


<p>
This section won't be too useful if you didn't go through the examples.
</p>
<p>
This package exports a few functions and combinators.  They are all
available both in lower-case and in upper-case (note this doesn't mean
they're case insensitive though).  I prefer to use upper-case for
combinators inside expressions, and lower-case for the compile/search
functions.
</p>
<ul>
<li><code>compile(expr)</code> — to compile an expression into bytecode
</li>
<li><code>search(array, expr, onmatch)</code> — to search a compiled expression on an array
</li>
</ul>


<p>
Expression combinators:
</p>
<ul>
<li><code>OR(case1, case2, ...)</code> — returns an expression that matches any of a few
  alternate cases;

</li>
<li><code>MAYBE(expr, [expr, ...])</code> — returns an expression that matches <code>expr</code> if
  found, but does not fail if not found;

</li>
<li><code>MANY(expr, [expr, ...])</code> — returns an expression that matches any number of
  occurrences of <code>expr</code> (or zero occurrences);

</li>
<li><code>MORE(expr, [expr, ...])</code> — match at least one occurrence of <code>expr</code>;

</li>
<li><code>ANYTHING()</code> — match any expression;

</li>
<li><code>WHATEVER()</code> — equivalent to <code>MANY(ANYTHING())</code>;

</li>
<li><code>GROUP(expr, [expr, ...])</code> — returns a single expression that matches a
  sequence of expressions;

</li>
<li><code>NAMED(name, expr, [expr, ...])</code> — like <code>GROUP</code> but gives the new
  expression a name.  If you omit <code>expr</code> it defaults to <code>ANYTHING()</code>;

</li>
<li><code>REF(name)</code> — returns an expression that matches the same content as
  matched previously by a <code>NAMED</code> group with name <code>name</code>;

</li>
<li><code>CHECK(predicate)</code> — matches the current expression if
  <code>predicate(expression)</code> returns non-false;

</li>
<li><code>END()</code> — matches only at the end of the array;

</li>
<li><code>MANYNG</code>, <code>MORENG</code>, <code>MAYBENG</code>, <code>WHATEVERNG</code> — the non-greedy versions for
  combinators involving backtracking.
</li>
</ul>


<p>
Above when I wrote <code>expr, [expr, ...]</code> I meant to say that those functions
take multiple arguments.  The following lines don't match the same
expressions:
</p>



<pre class="src src-js">GROUP(<span class="org-string">"a"</span>, <span class="org-string">"b"</span>, <span class="org-string">"c"</span>);
GROUP([ <span class="org-string">"a"</span>, <span class="org-string">"b"</span>, <span class="org-string">"c"</span> ]);
</pre>


<p>
I tried to stress this in some examples.  The first one matches the sequence
anywhere, while the second one asserts that the sequence is at the start of
an array.
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> The <code>onmatch</code> function </h3>
<div class="outline-text-3" id="text-4-1">


<p>
The function you pass to <code>search()</code> recevies one parameter, let's call it
<code>m</code>, that can be used to figure out various things about the match:
</p>
<ul>
<li><code>m.$node</code> — the array where the current match is found;
</li>
<li><code>m.$start</code> — the index in <code>$node</code> where the current match is found;
</li>
<li><code>m.$end</code> — the index where the match ends;
</li>
<li><code>m.$match()</code> — returns the current match as a <code>Match</code> object (see below);
</li>
<li>additionally, <code>NAMED</code> expressions insert properties into this object.
</li>
</ul>


<p>
This function may modify $node.  Some helper API is provided for this by
<code>Match</code> objects.  If it returns anything, it must be a valid index in
<code>$node</code>, and searching will continue at that position.  Without a return
value, the algorithm continues searching <b>after</b> the current match.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> The <code>Match</code> objects </h3>
<div class="outline-text-3" id="text-4-2">


<p>
They have the following methods:
</p>
<ul>
<li><code>replace(content)</code> — replaces the current node with the given <code>content</code>
  (which may be an array or a <code>Match</code> object);
</li>
<li><code>swap(node)</code> — swap two <code>Match</code> objects — meaning that the content of one
  replaces the content of the other in the original tree;
</li>
<li><code>content()</code> — returns the content that this node matches, as an array;
</li>
<li><code>first()</code> — returns the first node in the content; same as <code>content()[0]</code>.
</li>
</ul>


</div>
</div>

</div>
