doc/PatternJS.tex
\section{API reference}
\label{sec-4}


This section won't be too useful if you didn't go through the examples.

This package exports a few functions and combinators.  They are all
available both in lower-case and in upper-case (note this doesn't mean
they're case insensitive though).  I prefer to use upper-case for
combinators inside expressions, and lower-case for the compile/search
functions.

\begin{itemize}
\item \texttt{compile(expr)} — to compile an expression into bytecode
\item \texttt{search(array, expr, onmatch)} — to search a compiled expression on an array
\end{itemize}

Expression combinators:

\begin{itemize}
\item \texttt{OR(case1, case2, ...)} — returns an expression that matches any of a few
  alternate cases;
\item \texttt{MAYBE(expr, [expr, ...])} — returns an expression that matches \texttt{expr} if
  found, but does not fail if not found;
\item \texttt{MANY(expr, [expr, ...])} — returns an expression that matches any number of
  occurrences of \texttt{expr} (or zero occurrences);
\item \texttt{MORE(expr, [expr, ...])} — match at least one occurrence of \texttt{expr};
\item \texttt{ANYTHING()} — match any expression;
\item \texttt{WHATEVER()} — equivalent to \texttt{MANY(ANYTHING())};
\item \texttt{GROUP(expr, [expr, ...])} — returns a single expression that matches a
  sequence of expressions;
\item \texttt{NAMED(name, expr, [expr, ...])} — like \texttt{GROUP} but gives the new
  expression a name.  If you omit \texttt{expr} it defaults to \texttt{ANYTHING()};
\item \texttt{REF(name)} — returns an expression that matches the same content as
  matched previously by a \texttt{NAMED} group with name \texttt{name};
\item \texttt{CHECK(predicate)} — matches the current expression if
  \texttt{predicate(expression)} returns non-false;
\item \texttt{END()} — matches only at the end of the array;
\item \texttt{MANYNG}, \texttt{MORENG}, \texttt{MAYBENG}, \texttt{WHATEVERNG} — the non-greedy versions for
  combinators involving backtracking.
\end{itemize}

Above when I wrote \texttt{expr, [expr, ...]} I meant to say that those functions
take multiple arguments.  The following lines don't match the same
expressions:


\begin{minted}[frame=leftline,fontsize=\small,xleftmargin=\parindent]{js}
GROUP("a", "b", "c");
GROUP([ "a", "b", "c" ]);
\end{minted}

I tried to stress this in some examples.  The first one matches the sequence
anywhere, while the second one asserts that the sequence is at the start of
an array.
\subsection{The \texttt{onmatch} function}
\label{sec-4-1}


The function you pass to \texttt{search()} recevies one parameter, let's call it
\texttt{m}, that can be used to figure out various things about the match:

\begin{itemize}
\item \texttt{m.\$node} — the array where the current match is found;
\item \texttt{m.\$start} — the index in \texttt{\$node} where the current match is found;
\item \texttt{m.\$end} — the index where the match ends;
\item \texttt{m.\$match()} — returns the current match as a \texttt{Match} object (see below);
\item additionally, \texttt{NAMED} expressions insert properties into this object.
\end{itemize}

This function may modify \$node.  Some helper API is provided for this by
\texttt{Match} objects.  If it returns anything, it must be a valid index in
\texttt{\$node}, and searching will continue at that position.  Without a return
value, the algorithm continues searching \textbf{after} the current match.
\subsection{The \texttt{Match} objects}
\label{sec-4-2}


They have the following methods:

\begin{itemize}
\item \texttt{replace(content)} — replaces the current node with the given \texttt{content}
  (which may be an array or a \texttt{Match} object);
\item \texttt{swap(node)} — swap two \texttt{Match} objects — meaning that the content of one
  replaces the content of the other in the original tree;
\item \texttt{content()} — returns the content that this node matches, as an array;
\item \texttt{first()} — returns the first node in the content; same as \texttt{content()[0]}.
\end{itemize}
